routes/web.php

SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2, 3)
SELECT * FROM `posts`
SELECT * FROM `users` WHERE `users`.`id` in (1, 2, 3)
SELECT * FROM `posts` ORDER BY `created_at` DESC
---
|
*/

Route::get('/', function () {
    return view("posts", ["posts" => Post::latest()->with('category', 'user')->get()]);
});

SELECT * FROM `categories`
SELECT * FROM `posts` WHERE `posts`.`category_id` in (1, 2, 3)
---

Route::get('category/', function()
{
    return view('categories', ['categories' => Category::with('posts')->get()]);

SELECT * FROM `posts` WHERE `posts`.`user_id` in (1, 2, 3)
SELECT * FROM `users`
---
});

Route::get('users/', function(){
    return view('users', ['users'=> User::with('posts')->get()]);