app/Http/Controllers/CrudController.php

SELECT * FROM `todos`
---
    public function index(){
        $todos = Todo::all();

INSERT INTO `todos` (`title`, `description`, `updated_at`, `created_at`) VALUES ('home', 'they', '2021-05-25 11:00:18', '2021-05-25 11:00:18')
---
    public function store(Request $request)
    {
        $data = $request->validate([
            'title' => 'required|max:255',
            'description'   => 'required'
        ]);
        $todo = Todo::create($data);