app/Http/Controllers/Users.php

    public function getData(){
       $people = User::all();
---
SELECT * FROM `users`